Importamos librerias necesarias

In [1]:
import pandas as pd

In [8]:
url = "https://s3.us-west-2.amazonaws.com/secure.notion-static.com/63fd84c2-7500-45a8-bd97-745eae21a31c/train_data.txt?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20210120%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20210120T042250Z&X-Amz-Expires=86400&X-Amz-Signature=ad570184fd0c89e4ac2dde51691426efdc2ff11ea54e1a551d0b5b2fd1755fa2&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22train_data.txt%22"

In [16]:
base = pd.read_csv(url, sep = " ", usecols = [1])
base.columns = ['info']
base.head(10)

         info
0     1010286
1           7
2           F
3          40
4           0
5         COL
6      AirBnB
7  Registro 2
8     1000152
9           5

In [36]:
def containRegis(word):
    if "Registro" in word:
        return True
    else:
        return False
    
containRegis("Registr 2")

False

In [44]:
base2 = base[~base['info'].str.contains('Registro', na = False)]
base2.head(10)

       info
0   1010286
1         7
2         F
3        40
4         0
5       COL
6    AirBnB
8   1000152
9         5
10        M

In [84]:
id = pd.Series.reset_index(base2['info'][::7], drop = True)
id

0       1010286
1       1000152
2       1009019
3       1007840
4       1006939
         ...
9863    1002141
9864    1009145
9865    1008594
9866    1007938
9867    1000340
Name: info, Length: 9868, dtype: object

In [85]:
duracion_estadia = pd.Series.reset_index(base2['info'][1::7], drop = True)
duracion_estadia

0       7
1       5
2       4
3       5
4       5
       ..
9863    2
9864    6
9865    4
9866    3
9867    3
Name: info, Length: 9868, dtype: object

In [86]:
genero = pd.Series.reset_index(base2['info'][2::7], drop = True)
genero

0       F
1       M
2       F
3       F
4       M
       ..
9863    F
9864    M
9865    M
9866    M
9867    F
Name: info, Length: 9868, dtype: object

In [87]:
edad = pd.Series.reset_index(base2['info'][3::7], name = "edad")
edad

0        40
1       NaN
2        39
3        45
4        45
       ...
9863     42
9864     43
9865     39
9866     37
9867     49
Name: info, Length: 9868, dtype: object

In [88]:
kids = pd.Series.reset_index(base2['info'][4::7], drop = True)
kids

0       0
1       0
2       1
3       0
4       1
       ..
9863    0
9864    1
9865    0
9866    1
9867    1
Name: info, Length: 9868, dtype: object

In [89]:
codigo_destino = pd.Series.reset_index(base2['info'][5::7], drop = True)
codigo_destino

0       COL
1       NaN
2        ES
3        NL
4        UK
       ...
9863     ES
9864     PE
9865     IT
9866     IT
9867     IT
Name: info, Length: 9868, dtype: object

In [90]:
tipo_acomodacion = pd.Series.reset_index(base2['info'][6::7], drop = True)
tipo_acomodacion

0       AirBnB
1       AirBnB
2        Hotel
3        Hotel
4        Hotel
         ...
9863    AirBnB
9864    AirBnB
9865     Hotel
9866     Hotel
9867    AirBnB
Name: info, Length: 9868, dtype: object

In [93]:
base_final = pd.concat([id, duracion_estadia, genero, edad, kids, codigo_destino, tipo_acomodacion], axis = 1)
base_final.columns =['id', 'duracion_estadia', 'genero', 'edad', 'kids', 'codigo_destino', 'tipo_acomodacion']
base_final.head()

        id duracion_estadia genero edad kids codigo_destino tipo_acomodacion
0  1010286                7      F   40    0            COL           AirBnB
1  1000152                5      M  NaN    0            NaN           AirBnB
2  1009019                4      F   39    1             ES            Hotel
3  1007840                5      F   45    0             NL            Hotel
4  1006939                5      M   45    1             UK            Hotel